# IsLDSchematicViewObj

## Description
Check if the handle is a schematic view object.

```pascal
FUNCTION IsLDSchematicViewObj(handle : HANDLE) : BOOLEAN;
```

```python

def vs.IsLDSchematicViewObj(handle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE||

## Version
Availability: from Vectorworks 2025
## Category
* Spotlight